Repository: 84000/data-translation-memory
Catalog: toh558-v1.tmx
Source language: bo
Languages: en

source: ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེའི་དོན་ཀྱང་བྱས་པར་འགྱུར། སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་བྱས་པར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ཏེ།
en: I will then secure the welfare of the populace in the big city of Vaiśālī and there perform buddha activities on their behalf.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཆོས་གོས་དང་ཤམ་ཐབས་བགོས་ནས་ལྷུང་བཟེད་བསྣམས་ཏེ།
en: So, sure enough, in the morning the Blessed One donned his robes, picked up his alms bowl,

source: དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། ཐབས་ཅིག་ཏུ་བྱ་རྒོད་ཕུང་པོའི་རི་ལས་ཤོད་དུ་གཤེགས་པ་དང་།
en: and came down from Vulture Peak Mountain together with 1, 50 monks.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་ལྷའི་གདུགས་ལྔ་བརྒྱ་ཙམ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་གཡས་རོལ་ནས་ཕུལ་ལོ། །
en: Brahmā, master of the world, took five hundred divine parasols and offered them to the Blessed One on his right.

source: ཕུལ་ནས་བཅོམ་ལྡན་འདས་ལ་རྡུལ་ཡབ་ཀྱིས་གཡོབ་ཅིང་འདུག་པར་གྱུར་ཏོ། །
en: Having made the offering, Brahmā sat, fanning the Blessed One with a chowrie.

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་གདུགས་ལྔ་བརྒྱ་ཙམ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་གཡོན་རོལ་ནས་ཕུལ་ལོ། །
en: Śakra, lord of the gods, took five hundred divine parasols and offered them to the Blessed One on his left.

source: རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཀྱང་རེ་རེ་ཞིང་ལྷའི་གདུགས་ལྔ་བརྒྱ་ཙམ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་སྣམ་ལོགས་ནས་ཕུལ་ནས།
en: Each of the four great kings then took five hundred divine parasols and offered them to the Blessed One from behind.

source: བཅོམ་ལྡན་འདས་ལ་རྡུལ་ཡབ་ཀྱིས་གཡོབ་ཅིང་འདུག་པར་གྱུར་ཏོ། །
en: Having made the offering, they sat, fanning the Blessed One with a chowrie.

source: ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། གནོད་སྦྱིན་མཐུ་བོ་ཆེ་སུམ་ཅུ་རྩ་གཉིས་དང་། འཕྲོག་མའི་བུ་ལྔ་བརྒྱ་འཁོར་དང་བཅས་པས་ཀྱང་སོ་སོ་ནས་ལྷའི་གདུགས་དག་བླངས་ཏེ། ཉན་ཐོས་རྣམས་ལ་ཕུལ་ནས་རྡུལ་ཡབ་ཀྱིས་གཡོབ་ཅིང་འདུག་པར་གྱུར་ཏོ། །
en: Finally, the divine son Maheśvara, the twenty-eight great yakṣa generals, the thirty-two great yakṣa warriors, and Hārītī with her sons, all with their entourages, each took a divine parasol, offered it to the śrāvakas, then sat, fanning them with chowries.

source: དེ་ལྟ་བུའི་གྲགས་པ་དང་བཀུར་སྟི་དང་། བརྙེས་པར་བྱ་བ་བརྙེས་ནས།
en: Having received such accolades, respect, and reverence,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བྱ་རྒོད་ཕུང་པོའི་རི་ལས་ཤོད་དུ་བབས་ཏེ།
en: the Blessed One came down from Vulture Peak Mountain together with the saṅgha of monks and set out for the city of Vaiśālī.

source: ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་གཤེགས་པ་དང་། ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཤིན་ཏུ་མཛེས་པ། དད་པར་འོས་པ། དབང་པོ་ཞི་བ།
en: From a distance the Licchavi people of Vaiśālī saw the Blessed One coming. He was handsome and inspiring, and his senses were stilled.

source: ཐུགས་ཞི་བ། དབང་པོ་དུལ་བ། ཐུགས་དུལ་བ། དུལ་བ་དང་། ཞི་གནས་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྙེས་པ།
en: His mind was serene, his sense faculties were restrained, his mind was temperate, and he had attained the perfection of sublime tranquility.

source: དབང་པོ་དབེན་ཞིང་ཁུགས་པ། གླང་པོ་ཆེན་པོ་ལྟ་བུ་ཤིན་ཏུ་དུལ་བ། མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་རྣམ་པར་གསལ་བ།
en: His sense faculties were isolated and withdrawn. He was as well trained as an elephant, and as lucid, limpid, and clear as a lake.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ཤིན་ཏུ་བརྒྱན་པ།
en: His body was adorned with the thirty-two characteristics of a great being, and he was ornamented with the eighty fine marks.

source: ཤིང་སཱ་ལའི་རྒྱལ་པོ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་སྤྲས་པ།
en: He had the body of a thus-gone one, bedecked like the king of sal trees.

source: ཉི་མ་ལྟར་འོད་ཟེར་གྱི་དྲ་བ་ཀུན་ཏུ་འགྱེད་པ།
en: Like the sun, he emitted a profusion of light rays everywhere.

source: མཚན་མོ་མུན་པའི་ནང་ན་རི་བོའི་སྤོ་ལ་མེའི་ཕུང་པོ་རབ་ཏུ་འབར་བ་དང་འདྲ་ཞིང་བཅོམ་ལྡན་འདས་གསེར་གྱི་རི་བོ་ཆེན་པོ་དམ་པ་ལྟར་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་རྒྱང་རིང་པོ་ནས་གནས་དེར་གཤེགས་པ་མཐོང་ངོ་།
en: He was like a conflagration raging atop a mountain peak in the middle of a dark night, and brilliant and shining like a golden mountain.

source: མཐོང་མ་ཐག་ཏུ་ཡངས་པ་ཅན་གྱི་ལི་ཙྪ་བཱི་རྣམས་བཅོམ་ལྡན་འདས་ལ་སེམས་དད་པར་གྱུར་ནས།
en: As soon as the Licchavi people of Vaiśālī saw the Blessed One, they gained faith in him.

source: སེམས་དད་པར་གྱུར་པ་དེ་དག་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོར་ལམ་གང་ནས་གཤེགས་པའི་ལམ་དེ་ཕྱགས་ཤིང་ཆག་ཆག་འདེབས།
en: With faith they swept, anointed, cleansed, and strewed with flowers the path on which the Blessed One was traveling to the great city of Vaiśālī.

source: བྱི་དོར་བྱེད། མེ་ཏོག་འཐོར། དར་གྱི་ལྡ་ལྡི་དང་། དྲིལ་བུ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་ཏེ་བདུག་སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །
en: Having decorated the road with various silk wreaths, bells, parasols, standards, and banners, and having scented it with various incenses and perfumes, they approached the Blessed One and bowed at his feet.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་གི་མཐིལ་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པའི་རི་མོ་ཅན་མེ་ཏོག་པདྨའི་སྙིང་པོ་ལྟར་འཇམ་པ། སྔོན་ལེགས་པར་སྤྱད་པའི་མཚན་གྱིས་བརྒྱན་པ། གཞོན་ཤ་ཆགས་ཤིང་འཇམ་པ། ཉི་མའི་འོད་ཟེར་བས་ལྷག་པའི་འོད་དང་ལྡན་པ། འོད་ཟེར་བརྒྱ་ཕྲག་མང་པོ་ཀུན་ཏུ་འཕྲོ་བ། དྲི་མ་མེད་པའི་ཕྱག་གིས་ལིཙྪ་བཱི་དག་གི་མགོ་ལ་བྱུགས་ཏེ་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །
en: Then, with his stainless hand, radiating hundreds of light rays, tender and smooth, shining brighter than the rays of the sun, adorned with the signs of past virtuous conduct, as soft as the bulb of a lotus flower, and whose palm had the design of a thousand-spoked wheel, the Blessed One stroked the heads of the Licchavi people and instructed them.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ནང་དུ་གཤེགས་ནས་ནམ་གྱི་གུང་ཐུན་ལ་
en: Reaching the great city of Vaiśālī, the Blessed One stepped across the city threshold at midday.

source: སྒོ་སྐྱེས་ཀྱི་གཞི་ཞབས་ཀྱིས་མནན་ནས་ཕྱོགས་བཞིར་གཟིགས་ཏེ་ཕྱག་གསེར་གྱི་མདོག་ཅན་བརྐྱང་ནས་ན་བཟའ་བླ་གོས་གསོལ་ཏེ་བཀའ་སྩལ་པ།
en: Looking throughout the four directions, he extended his golden arm, adjusted his upper garment, and said,

source: སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་གདོན་ཐམས་ཅད་ལས་ཐར་བར་བྱེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྱག་རྒྱ་འདི་འཛིན་ཅིང་
en: “This queen of all incantations, Destroyer of the Great Trichiliocosm , is a Dharma teaching that liberates from all grahas. It is the seal of many buddhas, as many perfectly awakened, thus-gone arhats as there are grains of sand in the river Ganges.

source: ཕྱི་མའི་དུས་ན་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་འམ་གང་སུ་ཡང་རུང་བ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ལ་མཆོད་པ་བྱེད་པ་དང་།
en: Any monk or nun, or any man or woman with lay vows, who in the future worships the physical relics of the Thus-Gone One, even those as small as a mustard grain,

source: འཆང་བ་དང་། ཀློག་ཅིང་སྟོན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ལ་ཡམས་ཀྱི་ནད་དང་། འཇིགས་པ་དང་། འཚེ་བ་དང་། ནད་འགོ་བ་དང་། འཁྲུགས་པ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འཆིང་བ་དང་། ཁ་མཆུ་དང་། ཤགས་དང་། ཐ་ན་ཕྲ་མ་དང་། སྡིག་པ་མི་དགེ་བའི་སྡུག་བསྔལ་བའི་ལས་ཀྱིས་མི་ཚུགས་ཤིང་། འཚེ་བར་བྱེད་པ་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པར་འགྱུར་རོ།
en: who receives, holds, reads aloud, teaches, and masters this teaching will never be afflicted by any fever, peril, harm, epidemic, assault, strife, fight, bondage, argument, dispute, or slander. Such a person will be unaffected by the painful karma arising from non-virtuous, evil deeds. Such a person will be unaffected by any harm doers.”

source: བཅོམ་ལྡན་འདས་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, Brahmā, master of the world, asked the Blessed One,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་གསང་སྔགས་ཀྱི་རྒྱལ་མོ་གདོན་ཐམས་ཅད་ལས་ཐར་བར་བགྱིད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྱག་རྒྱ་དེ་གང་ལགས།
en: “Venerable Blessed One, what is the queen of secret mantras called Destroyer of the Great Trichiliocosm, the Dharma teaching that liberates from all grahas, the seal of the buddhas, as many perfectly awakened, thus-gone arhats as there are grains of sand in the river Ganges?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered Brahmā, master of the world,

source: ཚངས་པ་དེའི་ཕྱིར་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: “Brahmā, listen well and keep in mind what I am going to tell you!”

source: བཙུན་པ་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “As you say, Venerable One,” responded Brahmā, master of the world, to the Blessed One, and he paid attention as the Blessed One had instructed.

source: སྱཱད་ཡ་ཐེད་ན། ཨ་ཙ་ལེ། མ་ཙ་ལེ། སཱ་ར་མ་ཙ་ལེ། པྲ་ཀྲྀ་ཏི་བརྞེ་ཀྲྀ་ཏི་ནི་རྒྷོ་ཥེ། ས་མནྟ་མུ་ཁེ། སྠི་རེ་སྠཱ་པ་རེ་བི་གྷུཥྚེ། བི་གྷུཥྚ་ཤབྡེ་པྲ་ག་ལ་ནི། སཱ་རང་ག་མེ་སཱ་རཱ་སུ་ཏེ་སཱ་རངྒ་བ་ཏེ། བ་ལེ་མ་ཧཱ་བ་ལེ་མ་ཧཱ་ནིར་བྷཱ་སེ་སྭཱ་ཧཱ།
en: syād yathedaṃ acale macale sāramacale prakṛtivarṇe pra­kṛti­nirghoṣe samantamukhe sthire sthāvare vighuṣṭe vighuṣṭaśabde pragalani sāraṅgame sārāsute sāraṅgavate bale mahābale mahā­nirbhāse svāhā |

source: ལུས་སུ་གཏོགས་པ་དྲན་པ་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་དང་། ཏིང་ངེ་འཛིན་གསུམ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། རྗེས་སུ་དྲན་པ་དྲུག་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། རྣམ་པར་གྲོལ་བའི་སྐྱེ་མཆེད་བཅུ་གཅིག་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་དང་། རྣམ་པ་བཅུ་གཉིས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དང་། དབུགས་དབྱུང་བ་དང་རྔུབ་པ་རྗེས་སུ་དྲན་པ་རྣམ་པ་བཅུ་དྲུག་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་ཏེ་ཚངས་པ་དེ་ནི་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་
en: “Bodily mindfulness, tranquility and insight, the three absorptions, the four bases of supernatural power, the four thorough relinquishments, the four foundations of mindfulness, the four concentrations, the four truths of the noble ones, the five faculties, the five powers, the six kinds of mindfulness, the seven aspects of awakening, the eightfold path of the noble ones, the nine successive stages of meditative equipoise, the ten powers of a thus-gone one, the eleven liberated sense fields, the twelve links of dependent origination, the twelvefold wheel of Dharma, the sixteen recollections of inhaling and exhaling the breath, the eighteen unique attributes of a buddha, and the forty-two letters—all this, Brahmā, is in the queen of incantations called Destroyer of the Great Trichiliocosm

source: གདོན་ཐམས་ཅད་ལས་ཐར་བར་བྱེད་པའི་མདོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྱག་རྒྱ་སྟེ།
en: This is the sūtra that delivers from all grahas, the buddha seal of as many perfectly awakened, thus-gone arhats as there are grains of sand in the river Ganges.

source: སངས་རྒྱས་བསྒྲུབས་པའོ། །ཆོས་བསྒྲུབས་པའོ། །དགེ་འདུན་བསྒྲུབས་པའོ། །ཚངས་པ་བསྒྲུབས་པའོ། །དབང་པོ་བསྒྲུབས་པའོ། །འཇིག་རྟེན་སྐྱོང་བ་བསྒྲུབས་པའོ། །དབང་ཕྱུག་བསྒྲུབས་པའོ། །བདེན་པ་བསྒྲུབས་པའོ། །ལམ་བསྒྲུབས་པའོ། །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསྒྲུབས་པའོ། །ཟླ་བ་བསྒྲུབས་པའོ། །ཉི་མ་བསྒྲུབས་པའོ། །གཟའ་བསྒྲུབས་པའོ། །རྒྱུ་སྐར་བསྒྲུབས་པའོ། །
en: It is the accomplishment of the Buddha, the accomplishment of the Dharma, and the accomplishment of the Saṅgha. It is the accomplishment of Brahmā, the accomplishment of Indra, the accomplishment of the guardians of the world, and the accomplishment of Īśvara. It is the accomplishment of the truth, the accomplishment of the path, and the accomplishment of dependent origination. It is the accomplishment of the moon, the sun, the planets, and the stars.

source: སྱཱད་ཡ་ཐེ་དན། སཱ་ལེ་ཀ་སི་ནི། བི་དྷ་ར་ནི། བ་རཱ་གྲ། སཱ་རེ་ཨཱ་མརྵ་ཎི། ཨ་མོ་གྷ་བ་ཏི། ས་ཙ་ན་ཀཱ་ལི། ན་ཀཱ་ལི། ཀཱ་ཤི་ཀ་པ་ཏི། བྷ་ར་ཎི། བྷ་ར་ཀ་ཤ་ཁེ། ས་མནྟ་པྲཱཔྟེ། སཱཔྲཱཔྟེ། སཱ་ར་པྲཱཔྟེ། སྟམྦྷ་ནི། སྟམྦྷ་ན་པྲཱཔྟེ། བཛྲ་དྷ་རེ་སྭཱ་ཧཱ།
en: syād yathedam sāle kasine vidharaṇi varāgra sāre āmarṣaṇi amoghavati secanakāli nakāli kāśikavati bharaṇi bharakaśakhe samanta­prāpte sāraprāpte stambhani stambhana­prāpte vajradhare svāhā |

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then, the Blessed One uttered these verses:

source: འཇིག་རྟེན་འདི་འམ་ཡང་དག་འདས་པ་དང་། །མཐོ་རིས་དག་ན་རིན་ཆེན་མཆོག་ཡོད་པ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་ལྷར་གྱུར་པ། །མི་ཡི་མཆོག་དང་འདིར་ནི་མཚུངས་པ་མེད། །
en: “In this world or beyond there is nothing— Not even a precious gem in the higher realms— That equals the Thus-Gone One, the god of gods, The supreme among humans.

source: དེ་བས་འདི་ནི་རིན་ཆེན་མཆོག་ཏུ་གསུངས།
en: Thus, he is called the most precious gem.

source: བདེན་པ་དེ་ཡིས་འདིར་ནི་དགེ་བར་ཤོག །
en: By this truth may there be well-being here!

source: ཟད་པ་ཆགས་བྲལ་བདུད་རྩི་འདུས་མ་བྱས། །ཤེས་པས་ཤཱཀྱ་ཐུབ་དེས་རབ་ཏུ་ཕྱེ། །བདུད་རྩི་ཞི་བ་འདུས་བྱས་མ་ཡིན་པ། །ཆོས་དེ་དང་ནི་མཚུངས་པ་གང་ཡང་མེད། །
en: “There is nothing at all comparable to the Dharma Of uncompounded, quiescent ambrosia— The uncompounded ambrosia of extinction and dispassion Discerned by the Sage of the Śākyas through his knowledge.

source: མཆོག་ཏུ་གང་འདོད་ཚུལ་བཞིན་རབ་བསྟན་པ། །སྟོན་པའི་རྣལ་འབྱོར་བླ་མེད་རྟག་སྒྲུབ་པ། །རྡོ་རྗེ་ལྟ་བུའི་མིག་གཉིས་ལམ་མཐོང་བ། །ཏིང་འཛིན་དེ་དང་མཉམ་པ་ཡོད་མ་ཡིན། །
en: “There is nothing comparable to the absorption That perceives the vajra-like, non-dual path— The manifestation, in due order, of what is most desired, The permanent accomplishment of the teacher’s absolute practice.

source: གང་ཟག་ཆེན་པོ་བརྒྱད་པོ་རབ་བསྔགས་ཤིང་། །གང་ཟག་ཟུང་བཞིར་བརྗོད་པ་དེ་དག་ནི། །དྲང་སྲོང་ཆེན་པོ་གང་ཟག་མཚུངས་མེད་པ། །བདེ་བར་གཤེགས་པས་སྦྱིན་པའི་གནས་ཞེས་གསུངས། །
en: “The eight great kinds of person praised And called the four pairs , Extolled as ‘venerable’ by the Thus-Gone One, The incomparable person, the Great Sage, Yield great fruits when offered to,

source: དེ་ལ་བྱིན་ན་འབྲས་བུ་ཆེར་འགྱུར་ཏེ། །ཞིང་རབ་གཤིན་ལ་ས་བོན་བཏབ་པ་བཞིན། །འདི་ནི་དགེ་འདུན་རིན་ཆེན་མཆོག་ཏུ་གསུངས། །
en: Like seeds planted in a fertile field— This is called the most precious gem of the Saṅgha.

source: གང་དག་བརྟན་པའི་ཡིད་ཀྱིས་རབ་བརྩོན་ཞིང་། །གཽ་ཏ་མའི་བསྟན་ལ་འཇུག་བྱེད་ན། །དེ་དག་ཐོབ་ནས་བདུད་རྩི་འཇུག་ཐོབ་སྟེ། །མུན་པ་བསལ་ནས་མྱ་ངན་འདས་ཐོབ་པ། །དེ་བས་དགེ་འདུན་རིན་ཆེན་མཆོག་ཏུ་གསུངས། །
en: “Since those who strive with firm resolve

source: ལྟ་བ་འདི་ལ་སྦྱར་མ་ཐག་ཏུ་ནི། །འཇིག་ཚོགས་ལྟ་དང་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་དང་། །ཐེ་ཙོམ་དང་ནི་ཉོན་མོངས་གསུམ་པོ་དག །ཅིག་ཅར་སྤངས་ཏེ་འཕགས་པའི་བདེན་མཐོང་བ། །དེས་ན་དགེ་འདུན་རིན་ཆེན་མཆོག་ཏུ་གསུངས། །
en: “As soon as they connect with this vision, Belief in the transitory collection, Ethical discipline in the form of extreme austerity, And doubt are simultaneously cast off, And they see the truths of the noble ones. Thus, they are called the most precious gem of the Saṅgha.

source: ལུས་སམ་ངག་གམ་འོན་ཏེ་ཡིད་ཀྱིས་ཀྱང་། །སྡིག་པ་རྣམ་གསུམ་ནམ་ཡང་མི་བྱེད་ཅིང་། །བློ་བུར་བྱས་ནའང་འཆབ་པར་མི་བྱེད་ལ། །དེ་ལྟར་དེ་དག་ལྟ་བས་འཛིན་མི་བྱེད། །དེ་བས་དགེ་འདུན་རིན་ཆེན་མཆོག་ཏུ་གསུངས། །
en: “With body, speech, or mind They never produce the threefold evil deeds, And even when they suddenly do, they do not conceal them, And in that way, their view is not tainted with grasping. Thus, they are called the most precious gem of the Saṅgha.

source: དེས་ན་དགེ་འདུན་རིན་ཆེན་མཆོག་ཏུ་གསུངས། །བདེན་པ་དེ་ཡིས་འདིར་ནི་དགེ་བར་ཤོག །
en: Thus, they are called the most precious gem of the Saṅgha. By this truth may there be well-being here!

source: ཇི་ལྟར་དབང་པོའི་སྡོང་པོ་སར་བཙུགས་པ། །ཕྱོགས་བཞིའི་རླུང་རྣམས་ཀྱིས་ནི་མི་གཡོ་ལྟར། །འཕགས་པའི་ལམ་གྱི་དམ་པ་མཐོང་བ་ཡི། །གང་ཟག་འཕགས་པའི་དགེ་འདུན་དེ་བཞིན་ནོ། །
en: “Just as a threshold beam planted in the ground

source: ཇི་ལྟར་མེ་ནི་རླུང་གིས་རབ་གཏོར་བ། །ལག་ཏུ་བླངས་ཏེ་བགྲང་དུ་མེད་པ་ཉིད། །དེ་ལྟར་ཀུན་ཏུ་སྦྱོར་བ་རབ་བཏང་བ། །སངས་རྒྱས་སྲས་རྣམས་བསྟན་དུ་མེད་པར་འགྲོ། །
en: “Just as a flame extinguished by the wind

source: སེམས་ཅན་གང་དག་འགྲོ་དང་མི་འགྲོ་བ། །དེ་དག་ཐམས་ཅད་འདིར་ནི་བདེ་གྱུར་ཅིག །སྟོན་མཆོག་དམ་པ་ལྷ་མིས་མཆོད་འོས་པ། །སངས་རྒྱས་ཕྱག་འཚལ་དེང་འདིར་དགེ་བར་ཤོག །
en: “May all sentient beings, moving or still, be well here! And may they pay homage to the Buddha, The supreme teacher, venerated by gods and men! May there be well-being here today!

source: སེམས་ཅན་གང་དག་འགྲོ་དང་མི་འགྲོ་བ། །དེ་དག་ཐམས་ཅད་འདིར་ནི་བདེ་གྱུར་ཅིག །ཞི་བ་ཆགས་བྲལ་ལྷ་མིས་མཆོད་འོས་པ། །ཆོས་ལ་ཕྱག་འཚལ་དེང་འདིར་དགེ་བར་ཤོག །
en: “May all sentient beings, moving or still, be well here! May they pay homage to the Dharma, The peaceful dispassion venerated by gods and men! May there be well-being here today!

source: སེམས་ཅན་གང་དག་འགྲོ་དང་མི་འགྲོ་བ། །དེ་དག་ཐམས་ཅད་འདིར་ནི་བདེ་གྱུར་ཅིག །ཚོགས་ཀྱི་དམ་པ་ལྷ་མིས་མཆོད་འོས་པ། །དགེ་འདུན་ཕྱག་འཚལ་དེང་འདིར་དགེ་བར་ཤོག །
en: “May all sentient beings, animate and inanimate, be well here! May they pay homage to the Saṅgha, The supreme assembly venerated by gods and men! May there be well-being here today!

source: སེམས་ཅན་གང་དག་འགྲོ་དང་མི་འགྲོ་བ། །དེ་དག་ཐམས་ཅད་འདིར་ནི་བདེ་གྱུར་ཅིག །འབྱུང་པོ་གང་དག་འདིར་ནི་ལྷགས་གྱུར་ཏེ། །ས་འམ་འོན་ཏེ་བར་སྣང་འཁོད་པ་དག །སྐྱེ་དགུ་རྣམས་ལ་རྟག་ཏུ་བྱམས་བྱེད་ཤོག ཉིན་དང་མཚན་དུ་ཆོས་ཀྱང་སྤྱོད་པར་ཤོག
en: “May whatever bhūtas are assembled here, All those that dwell upon the earth or in the sky, Act always lovingly toward all creatures And practice Dharma day and night!

source: འདི་ནི་རྒྱལ་བ་དགྲ་རྒྱལ་བདེན་གང་གིས། །ཤིན་ཏུ་བདེན་པ་གསུང་ཞིང་རྫུན་མེད་པ། །བདེན་པ་དེ་ཡིས་འདིར་ནི་དགེ་བར་ཤོག །དེ་ཀུན་འཇིགས་པ་ཆེ་ལས་ཐར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: “By the truth that the Victorious One, having vanquished his foes,

source: སྱཱད་ཡ་ཐེ་དན། དྷི་རེ་དྷི་དྷི་རེ། བ་ལི་ནི་རྒྷོ་ཥེ། བ་ལི་སྭ་རེ། སཱ་ར་བ་ཏེ། སྟུ་ཏི་པྲ་སྟུ་ཏི་པྲཱཔྟེ། ཨཱ་ར་བེ། ཨ་ར་ནི་རྒྷོ་ཥེ། ཨཱ་ར་བ་ཏི། ཨ་ཙྱུ་ཏེ་བ་ལ་བ་ཏེ། ཤཱུ་ར་པྲཱཔྟེ། སཱ་རཾ་ག་མེ། སུརྱ་བ་ལེ། སཱུརྱ་ནི་རྒྷོ་ཥེ་སྭཱ་ཧཱ།
en: syād yathedam dhire dhidhire bali­nirghoṣe balisvare sāravate stuti prastuti­prāpte ārave aranirghoṣe āravati acyute balavate śūraprāpte sāraṃgame sūryavale sūrya­nirghoṣe svāhā |

source: ཚངས་པ་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་གདོན་ཐམས་ཅད་ལས་རབ་ཏུ་ཐར་བར་བྱེད་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྱག་རྒྱའོ། །
en: “Brahmā, this queen of incantations called Destroyer of the Great Trichiliocosm , which delivers from all grahas, is the buddha seal of as many perfectly awakened, thus-gone arhats as there are grains of sand in the river Ganges.

source: སངས་རྒྱས་ཀྱི་གནས་སོ། །ཆོས་ཀྱི་གནས་སོ། །དགེ་འདུན་གྱི་གནས་སོ། །
en: It is the abode of the Buddha, the abode of the Dharma, and the abode of the Saṅgha.

source: ཚངས་པའི་གནས་སོ། །དབང་པོའི་གནས་སོ། །འཇིག་རྟེན་སྐྱོང་བའི་གནས་སོ། །དབང་ཕྱུག་གི་གནས་སོ། །
en: It is the abode of Brahmā, the abode of Indra, the abode of the guardians of the world, and the abode of Īśvara.

source: དྲང་སྲོང་ཆེན་པོའི་གནས་སོ། །འབྱུང་པོའི་གནས་སོ། །མིག་གི་གནས་སོ། །རྒྱུའི་གནས་སོ། །ཕྱོགས་ཀྱི་གནས་སོ། །བསྟན་པའི་གནས་སོ།
en: It is the abode of great sages, the abode of the elements, the abode of the eyes, the abode of causes, the abode of spatial extension, and the abode of the teachings.

source: སངས་རྒྱས་རྣམས་ཀྱི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའོ། །
en: It is the complete and perfect awakening of all buddhas.

source: ཉན་ཐོས་རྣམས་ཀྱི་རེག་པའོ། །ཚངས་པས་བྱིན་གྱིས་བརླབས་པའོ། །དབང་པོའི་རབ་ཏུ་བསྔགས་པའོ། །འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱི་མཆོད་པའོ། །དབང་ཕྱུག་གི་ཕྱག་བྱས་པའོ། །ལྷ་ཐམས་ཅད་ཀྱི་ཀུན་ཏུ་མཆོད་པའོ། །རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་ཀྱི་བསྔགས་པའོ། །
en: It is touched by śrāvakas, blessed by Brahmā, praised by Indra, revered by the world protectors, worshipped by Īśvara, extolled by the gods, and saluted by yoga practitioners.

source: མཁས་པ་རྣམས་མངོན་པར་དགའ་བར་གྱུར་པའོ། །དྲང་སྲོང་རྣམས་ཀྱི་རབ་ཏུ་བསྔགས་པའོ། །ཚངས་པ་རྣམས་ཀྱི་རབ་ཏུ་བརྒྱན་པའོ། །ལྷ་རྣམས་ཀྱི་མངོན་པར་བསྟོད་པའོ། །ཁྲུས་བྱེད་པ་རྣམས་ཀྱི་བསང་བའོ། །རིགས་བཞིའི་འཇིག་རྟེན་གྱི་དགའ་བར་བྱས་པའོ། །
en: It delights scholars. It is praised by sages. It is adorned by priests. It is praised by the gods. It is cleansed by those who perform ritual ablutions. It is delighted in by the world of the four castes.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལོ། །རང་སངས་རྒྱས་རྣམས་ཀྱི་སྐྱེད་མོས་ཚལ་ལོ། །དྲང་སྲོང་རྣམས་ཀྱི་གནས་སོ། །ཉན་ཐོས་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པའོ། །རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་འབྱུང་གནས་སོ། །
en: It is the domain of all buddhas, the garden of pratyekabuddhas, the abode of sages, the nirvāṇa of śrāvakas, the abode of yoga practitioners, and the source of the qualities of awakening.

source: ཉོན་མོངས་པ་རྣམས་འཇོམས་པའོ། །བག་ལ་ཉལ་གྱི་ཟུག་རྔུ་རྣམས་འབྱིན་པའོ། །འཕགས་པའི་ལམ་ཀུན་ཏུ་སྟོན་པའོ། །ཐར་པའི་སྒོ་རྣམས་འབྱེད་པའོ། །འཇིག་ཚོགས་ལ་ལྟ་བ་རྣམས་འཇིག་པར་བྱེད་པའོ། །ང་རྒྱལ་གྱི་རི་རབ་ཏུ་བསྙིལ་བར་བྱེད་པའོ། །འཁོར་བའི་རྒྱ་མཚོ་སྐེམས་པའོ། །
en: It is the destroyer of afflictions. It uproots latent pains. It fully teaches the path of the noble ones. It opens the gates to liberation. It eradicates all beliefs in the transitory collection. It demolishes the mountain of pride. It dries the ocean of saṃsāra.

source: འཁོར་བའི་རྒྱ་མཚོར་ལྷུང་བའི་སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བའོ། །
en: It liberates all sentient beings who have fallen into the ocean of saṃsāra.

source: བདུད་ཀྱི་ཞགས་པ་གཅོད་པའོ། །བདུད་ཀྱི་འཁོར་སྐྲག་པར་བྱེད་པའོ། །བདུད་ཀྱི་མཆིལ་མ་འདོར་བའོ། །ཉོན་མོངས་པའི་གཡུལ་ལས་སྒྲོལ་བའོ། །མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པར་བྱེད་པའོ། །འཁོར་བའི་ཁྱིམ་ནས་འབྱུང་བར་བྱེད་པའོ། །
en: It severs Māra’s noose. It frightens Māra’s entourage. It scatters Māra’s spit. It overcomes the army of afflictions. It inducts one into the city of nirvāṇa.

source: སྱཱད་ཡ་ཐེ་དན། ཁཌྒེ་ཁངྒེ་ཁཌྒེ་གྷོ། ཨུ་ཤོ་དྷ་ནེ། སཱ་ར་ཐི། པྲ་བྷེ་དེ། བི་པུ་ལ་པྲ་བྷེ། སཾ་ཀརྠ་ཎི། བི་ཀརྠ་ཎི། བི་ཤ་གྲ་བ་ཏེ། ཤུད་དྷ་སཱ་དྷ་ནི། བ་རུ་ཎ་བ་ཏེ། བཱ་ས། པེ་བྷུ་ཥེ་ནེ། བེ་སཾ་ག་མེ། པ་ཤུ་པ་ཏི། པུསྤ་གརྦྷེ།
en: syād yathedam khaṅge khaṅge khaṅgeghoṣe uṣodhane sārathi prabhede vipulaprabhe saṃkarṭhaṇi vikarṭhaṇi viśagravate śuddhasādhani varuṇavate vāsa vibhūṣeṇe vesaṃgame paśupati puspagarbhe |

source: བདག་དང་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་དང་ཉེ་བར་འཚེ་བ་དང་ངལ་བ་ཐམས་ཅད་ལས་བདེ་ལེགས་སུ་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: May I and all sentient beings be safe from all perils, calamities, and misfortunes! Svāha

source: སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་གདོན་ཐམས་ཅད་ལས་ཐར་བར་བྱེད་པའི་མདོ་སྡེ་འདི་ནི་
en: “This queen of incantations called Destroyer of the Great Trichiliocosm is the sūtra that delivers from all grahas.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཕྱག་རྒྱ་སྟེ།
en: It is the buddha seal of as many perfectly awakened, thus-gone arhats as there are grains of sand in the river Ganges.

source: འདིས་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཕྱག་རྒྱས་བཏབ་པ་སྟེ།
en: It seals the world with its gods, humans, and asuras

source: མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་བླ་ན་མེད་པར་ཞུགས་སོ། །
en: and poises it for the supreme city of nirvāṇa.

source: དེའི་དོན་གྱི་ཕྱིར་སྔོན་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། །རང་སངས་རྒྱས་རྣམས་དང་། ཉན་ཐོས་རྣམས་དང་། ཕ་མ་དང་། སྦྱིན་གནས་དང་། བླ་མ་ལྟ་བུ་རྣམས་ལ་བསྙེན་བཀུར་ཏོ། །
en: For its sake, the previous perfect and complete buddhas—the fully awakened ones—as well as the pratyekabuddhas and śrāvakas are honored like parents, objects of veneration, and gurus.

source: ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །ཚུལ་ཁྲིམས་བསྲུངས་སོ། །སྦྱིན་པ་བྱིན་ནོ། །སྙིང་རྗེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྐངས་སོ། །བྱང་ཆུབ་ཐོབ་པར་བསྒྲུབས་སོ། །བདུད་ཕམ་པར་བྱས་སོ། །
en: For its sake, chastity is practiced, discipline is observed, generosity is enacted, and the perfection of compassion is fulfilled. The attainment of awakening is accomplished. Māra is vanquished.”
